In [23]:
import numpy as np
import pandas as pd

In [24]:
from numpy.random import randn

In [25]:
np.random.seed(101)

In [63]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','x','Y','Z'])

In [27]:
df #creating and displaying data frame

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df > 0 #conditional selection

       W      x      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [29]:
booldf = df>0 #defining variable for conditional selection

In [30]:
booldf

       W      x      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [31]:
df[booldf] #will return only positive values

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [34]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
df[df['W']>0] #will return only rows with the defined condition

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df[df['Z']<0] #same as above

          W         x         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [37]:
resultdf = df[df['W']>0]

In [38]:
resultdf

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
resultdf['x']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: x, dtype: float64

In [41]:
df[df['W']>0]['x']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: x, dtype: float64

In [45]:
df[df['W']>0][['x','Y']]

          x         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [46]:
boolser = df['W']>0
result = df[boolser]

In [47]:
result

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
result[['Y','x']] #or cols = ['Y','x'] and result[cols]

          Y         x
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [49]:
df[(df['W']>0) and (df['Y']>1)] #Important error for beginners

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [50]:
True and True

True

In [51]:
df[(df['W']>0) & (df['Y']>1)] #use andpercent

          W         x         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df[(df['W']>0) | (df['Y']>1)] #replacement for or

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

   level_0 index         W         x         Y         Z
0        0     A  2.706850  0.628133  0.907969  0.503826
1        1     B  0.651118 -0.319318 -0.848077  0.605965
2        2     C -2.018168  0.740122  0.528813 -0.589001
3        3     D  0.188695 -0.758872 -0.933237  0.955057
4        4     E  0.190794  1.978757  2.605967  0.683509

In [64]:
df

          W         x         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [65]:
newind = 'CA NY WY OR CO'.split()

In [66]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [67]:
df['States'] = newind

In [68]:
df

          W         x         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

how to set column as index??

In [69]:
df.set_index('States')

               W         x         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [70]:
df

          W         x         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

We will learn multi-index and hierarchy in next lecture part 3